Postman/Credit Check Service.postman_collection.json

{
	"info": {
		"_postman_id": "70a8f381-e1a8-480b-9ecc-c82f26e8bc0d",
		"name": "Credit Check Service",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "3111078",
		"_collection_link": "https://mytreasuretrove.postman.co/workspace/TFO-DevCamp-Dev-Squadron~2cab436c-4c8f-4ca8-93a7-6a6180435bca/collection/3111078-70a8f381-e1a8-480b-9ecc-c82f26e8bc0d?action=share&creator=3111078&source=collection_link"
	},
	"item": [
		{
			"name": "Credit Check",
			"request": {
				"method": "POST",
				"header": [],
				"body": {
					"mode": "raw",
					"raw": "<soapenv:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ent=\"entelect:devcamp:creditcheckservice\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <ent:CreditCheck soapenv:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\">\r\n         <customerId xsi:type=\"xsd:int\">123</customerId>\r\n      </ent:CreditCheck>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "{{baseurl}}:{{port_cc}}/CreditCheck",
					"host": [
						"{{baseurl}}"
					],
					"port": "{{port_cc}}",
					"path": [
						"CreditCheck"
					]
				}
			},
			"response": []
		}
	],
	"auth": {
		"type": "basic",
		"basic": [
			{
				"key": "password",
				"value": "password",
				"type": "string"
			},
			{
				"key": "username",
				"value": "user",
				"type": "string"
			}
		]
	}
}